OS-Q/simba/make/arduino/esp/boards.txt
#
# @section License
#
# The MIT License (MIT)
#
# Copyright (c) 2014-2017, Erik Moqvist
#
# Permission is hereby granted, free of charge, to any person
# obtaining a copy of this software and associated documentation
# files (the "Software"), to deal in the Software without
# restriction, including without limitation the rights to use, copy,
# modify, merge, publish, distribute, sublicense, and/or sell copies
# of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be
# included in all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
# EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
# MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
# NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
# BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
# ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
# CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.
#
# This file is part of the Simba project.
#
##################################################################

esp12e.name=ESP12E

esp12e.upload.tool=esptool
esp12e.upload.speed=115200
esp12e.upload.resetmethod=ck
esp12e.upload.maximum_size=1044464
esp12e.upload.maximum_data_size=81920
esp12e.upload.wait_for_upload_port=true
esp12e.serial.disableDTR=true
esp12e.serial.disableRTS=true

esp12e.build.mcu=esp8266
esp12e.build.f_cpu=80000000L
esp12e.build.board=ESP12E
esp12e.build.variant=esp12e
esp12e.build.core=Simba:simba
esp12e.build.flash_size=4M
esp12e.build.flash_mode=dio
esp12e.build.flash_freq=40

esp12e.compiler.c.extra_flags={esp12e_compiler_c_extra_flags}
esp12e.compiler.cpp.extra_flags={esp12e_compiler_cxx_extra_flags}
esp12e.compiler.c.elf.extra_flags={esp12e_compiler_c_elf_extra_flags}
esp12e.compiler.c.elf.libs={esp12e_compiler_c_elf_libs}

##################################################################


B51A.name=B51A

B51A.upload.tool=esptool
B51A.upload.speed=115200
B51A.upload.resetmethod=ck
B51A.upload.maximum_size=434160
B51A.upload.maximum_data_size=81920
B51A.upload.wait_for_upload_port=true
B51A.serial.disableDTR=true
B51A.serial.disableRTS=true

B51A.build.mcu=esp8266
B51A.build.f_cpu=80000000L
B51A.build.board=ESP01
B51A.build.variant=esp01
B51A.build.core=Simba:simba
B51A.build.ldscript=simba.flash.1m.ld
B51A.build.flash_size=512K
B51A.build.flash_mode=dio
B51A.build.flash_freq=40

B51A.compiler.c.extra_flags={esp01_compiler_c_extra_flags}
B51A.compiler.cpp.extra_flags={esp01_compiler_cxx_extra_flags}
B51A.compiler.c.elf.extra_flags={esp01_compiler_c_elf_extra_flags}
B51A.compiler.c.elf.libs={esp01_compiler_c_elf_libs}

##################################################################

B51B.name=B51B

B51B.upload.tool=esptool
B51B.upload.speed=115200
B51B.upload.resetmethod=ck
B51B.upload.maximum_size=434160
B51B.upload.maximum_data_size=81920
B51B.upload.wait_for_upload_port=true
B51B.serial.disableDTR=true
B51B.serial.disableRTS=true

B51B.build.mcu=esp8266
B51B.build.f_cpu=80000000L
B51B.build.board=ESP01
B51B.build.variant=esp01
B51B.build.core=Simba:simba
B51B.build.ldscript=simba.flash.1m.ld
B51B.build.flash_size=512K
B51B.build.flash_mode=dio
B51B.build.flash_freq=40

B51B.compiler.c.extra_flags={esp01_compiler_c_extra_flags}
B51B.compiler.cpp.extra_flags={esp01_compiler_cxx_extra_flags}
B51B.compiler.c.elf.extra_flags={esp01_compiler_c_elf_extra_flags}
B51B.compiler.c.elf.libs={esp01_compiler_c_elf_libs}

##################################################################

B51C.name=B51C

B51C.upload.tool=esptool
B51C.upload.speed=115200
B51C.upload.resetmethod=nodemcu
B51C.upload.maximum_size=1044464
B51C.upload.maximum_data_size=81920
B51C.upload.wait_for_upload_port=true
B51C.serial.disableDTR=true
B51C.serial.disableRTS=true

B51C.build.mcu=esp8266
B51C.build.f_cpu=80000000L
B51C.build.board=NodeMCU
B51C.build.variant=nodemcu
B51C.build.core=Simba:simba
B51C.build.flash_size=4M
B51C.build.flash_mode=qio
B51C.build.flash_freq=40

B51C.compiler.c.extra_flags={nodemcu_compiler_c_extra_flags}
B51C.compiler.cpp.extra_flags={nodemcu_compiler_cxx_extra_flags}
B51C.compiler.c.elf.extra_flags={nodemcu_compiler_c_elf_extra_flags}
B51C.compiler.c.elf.libs={nodemcu_compiler_c_elf_libs}

##################################################################

B51D.name=B51D

B51D.upload.tool=esptool
B51D.upload.speed=115200
B51D.upload.resetmethod=ck
B51D.upload.maximum_size=1044464
B51D.upload.maximum_data_size=81920
B51D.upload.wait_for_upload_port=true
B51D.serial.disableDTR=true
B51D.serial.disableRTS=true

B51D.build.mcu=esp8266
B51D.build.f_cpu=80000000L
B51D.build.board=ESP12E
B51D.build.variant=esp12e
B51D.build.core=Simba:simba
B51D.build.flash_size=4M
B51D.build.flash_mode=dio
B51D.build.flash_freq=40

B51D.compiler.c.extra_flags={esp12e_compiler_c_extra_flags}
B51D.compiler.cpp.extra_flags={esp12e_compiler_cxx_extra_flags}
B51D.compiler.c.elf.extra_flags={esp12e_compiler_c_elf_extra_flags}
B51D.compiler.c.elf.libs={esp12e_compiler_c_elf_libs}

##################################################################

B51E.name=B51E

B51E.upload.tool=esptool
B51E.upload.speed=115200
B51E.upload.resetmethod=nodemcu
B51E.upload.maximum_size=1044464
B51E.upload.maximum_data_size=81920
B51E.upload.wait_for_upload_port=true
B51E.serial.disableDTR=true
B51E.serial.disableRTS=true

B51E.build.mcu=esp8266
B51E.build.f_cpu=80000000L
B51E.build.board=NodeMCU
B51E.build.variant=nodemcu
B51E.build.core=Simba:simba
B51E.build.flash_size=4M
B51E.build.flash_mode=qio
B51E.build.flash_freq=40

B51E.compiler.c.extra_flags={nodemcu_compiler_c_extra_flags}
B51E.compiler.cpp.extra_flags={nodemcu_compiler_cxx_extra_flags}
B51E.compiler.c.elf.extra_flags={nodemcu_compiler_c_elf_extra_flags}
B51E.compiler.c.elf.libs={nodemcu_compiler_c_elf_libs}

##################################################################
